MusicApp/app/controllers/albums_controller.rb

    def new
        @band = Band.find(params[:band_id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        if @album.save!
---
INSERT INTO "albums" ("title", "year", "band_id", "live", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Reign in Blood"], ["year", 1986], ["band_id", 1], ["live", true], ["created_at", "2019-08-06 23:52:20.477545"], ["updated_at", "2019-08-06 23:52:20.477545"]]