MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Slayer"], ["created_at", "2019-08-06 22:17:34.945440"], ["updated_at", "2019-08-06 22:17:34.945440"]]
---
    def create
        @band = Band.new(band_params)

        if @band.save!