MusicApp/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
        <select name="album[band_id]" id="">
        <% Band.all.each do |band| %>